{"date":"1990-09-15","platform":"TV","images":{"small":"https://lain.bgm.tv/r/200/pic/cover/l/e1/35/36115_f0lLl.jpg","grid":"https://lain.bgm.tv/r/100/pic/cover/l/e1/35/36115_f0lLl.jpg","large":"https://lain.bgm.tv/pic/cover/l/e1/35/36115_f0lLl.jpg","medium":"https://lain.bgm.tv/r/800/pic/cover/l/e1/35/36115_f0lLl.jpg","common":"https://lain.bgm.tv/r/400/pic/cover/l/e1/35/36115_f0lLl.jpg"},"summary":"Gaia, the spirit of the Earth, is awakened from a long sleep by Hoggish Greedly, who happens to be drilling above her resting chamber. Realizing that the damage is extensive, Gaia sends five magic rings, four with the power to control an element of nature and one controlling the element of Heart, to five chosen youths across the globe: Kwame from Africa, Wheeler from North America, Linka from the Soviet Union (changed to Eastern Europe after the Soviet Union's collapse), Gi from Asia, and Ma-Ti from South America.\r\n\r\nThese five are dubbed the Planeteers and are tasked with defending the Earth from the greatest of disasters and making efforts to educate mankind to keep others from happening. Gaia uses her \"Planet Vision\" to discover where the most devastating destruction is occurring and sends the Planeteers to help solve the problem. The Planeteers use transportation (usually a flying machine called a Geo-Cruiser) based on solar power to avoid causing pollution themselves.\r\n\r\nIn situations that the Planeteers cannot resolve alone, they can combine their powers to summon Captain Planet, a magical entity who possesses all of their powers magnified, symbolizing the premise that the combined efforts of a team are stronger than its individual parts. Captain Planet only appears in his Captain Planet garb. These are not clothes but elements of the Earth that are integral to his composition. He is able to rearrange his molecular structure to transform himself into the various powers and elements of nature. Captain Planet's outfit does not represent a specific culture.[citation needed] He has a grass-green proto-mullet, crystal skin, earthy brown eyes, a fire-red chest, gloves, and boots, and a sun-yellow globe insignia.\r\n\r\nIn a manner similar to the mid 1950s–1986 incarnation of Superman, Captain Planet has superhuman powers, and seems to gain more proportionate to whatever the situation requires. Nevertheless, he is weakened by pollutants which sap his strength, from smog to nuclear radiation, in much the same manner that Superman is weakened by Kryptonite. Captain Planet's personality is also similar to that of the Silver Age version of Superman; always remaining friendly and upbeat in the darkest of situations. Like the Silver Age Superman, he also dislikes killing even the cruellest bad guys and has a strict sense of justice (such as when Captain Planet allowed himself to be jailed for a crime he did not commit).\r\n\r\nThe Planeteers cannot use their individual powers while Captain Planet has been summoned.[8] Despite his vulnerability to pollution, Captain Planet is a formidable and valiant hero. Once his work is done, Captain Planet returns to the Earth, restoring the Planeteers' powers. When he does this, Captain Planet reminds viewers of the message of the series with his catchphrase, \"The Power Is Yours!\"","name":"Captain Planet and the Planeteers","name_cn":"地球超人","tags":[{"name":"童年","count":17,"total_cont":0},{"name":"欧美","count":14,"total_cont":0},{"name":"那个电视里还会放动画的年代","count":8,"total_cont":0},{"name":"美国","count":7,"total_cont":0},{"name":"TV","count":6,"total_cont":0},{"name":"地球超人","count":6,"total_cont":0},{"name":"童年系列","count":3,"total_cont":0},{"name":"Nicholas_Boxer","count":3,"total_cont":0},{"name":"1990","count":3,"total_cont":0},{"name":"Barbara_Pyle","count":3,"total_cont":0},{"name":"Thom_Beers","count":3,"total_cont":0},{"name":"DiC","count":1,"total_cont":0},{"name":"Phil_Harnage","count":1,"total_cont":0},{"name":"Bob_Forward","count":1,"total_cont":0},{"name":"Action","count":1,"total_cont":0},{"name":"童年系","count":1,"total_cont":0},{"name":"90年代","count":1,"total_cont":0},{"name":"动画","count":1,"total_cont":0},{"name":"杂","count":1,"total_cont":0},{"name":"经典","count":1,"total_cont":0},{"name":"Turner_Program_Services","count":1,"total_cont":0},{"name":"Hanna-Barbera","count":1,"total_cont":0},{"name":"DIC_Entertainment","count":1,"total_cont":0}],"infobox":[{"key":"中文名","value":"地球超人"},{"key":"话数","value":"113"},{"key":"放送开始","value":"1990年9月15日"},{"key":"播放电视台","value":"TBS"},{"key":"播放结束","value":"1996年5月11日"},{"key":"Copyright","value":"DIC Entertainment (1990–1993)  Hanna-Barbera (1993–1996)  Turner Program Services"}],"rating":{"rank":4529,"total":59,"count":{"1":0,"2":2,"3":0,"4":2,"5":8,"6":21,"7":21,"8":4,"9":0,"10":1},"score":6.2},"total_episodes":50,"collection":{"on_hold":7,"dropped":15,"wish":5,"collect":103,"doing":2},"id":36115,"eps":113,"meta_tags":["TV","欧美"],"volumes":0,"series":false,"locked":false,"nsfw":false,"type":2}